In [2]:
import pandas as pd

In [13]:
sales = pd.read_csv("sales.csv")
sales

,OrderID,Product,Category,Price,Quantity,Total,CustomerID,PurchaseDate
0,1,Apple,Electronics,999.99,1,999.99,12345,2023-05-01
1,2,Shampoo,Beauty,7.99,3,23.97,12346,2023-05-02
2,3,Laptop,Electronics,799.99,2,1599.98,12347,2023-05-02
3,4,TV,Electronics,499.99,1,499.99,12348,2023-05-03
4,5,Toothpaste,Beauty,2.99,4,11.96,12349,2023-05-03
5,6,Headphones,Electronics,199.99,2,399.98,12350,2023-05-04
6,7,Microwave,Home Appliances,149.99,1,149.99,12351,2023-05-05
7,8,Blender,Home Appliances,79.99,3,239.97,12352,2023-05-05
8,9,Camera,Electronics,499.99,1,499.99,12353,2023-05-06
9,10,Watch,Fashion,99.99,1,99.99,12354,2023-05-07

In [25]:
sales[sales["Quantity"] == sales["Quantity"].max()]

,OrderID,Product,Category,Price,Quantity,Total,CustomerID,PurchaseDate
4,5,Toothpaste,Beauty,2.99,4,11.96,12349,2023-05-03

In [27]:
sales[sales["Price"] == sales["Price"].max()]

,OrderID,Product,Category,Price,Quantity,Total,CustomerID,PurchaseDate
0,1,Apple,Electronics,999.99,1,999.99,12345,2023-05-01

In [49]:
sales_sorted = sales.sort_values("PurchaseDate", ascending=False)

In [51]:
sales_sorted

,OrderID,Product,Category,Price,Quantity,Total,CustomerID,PurchaseDate
9,10,Watch,Fashion,99.99,1,99.99,12354,2023-05-07
8,9,Camera,Electronics,499.99,1,499.99,12353,2023-05-06
6,7,Microwave,Home Appliances,149.99,1,149.99,12351,2023-05-05
7,8,Blender,Home Appliances,79.99,3,239.97,12352,2023-05-05
5,6,Headphones,Electronics,199.99,2,399.98,12350,2023-05-04
3,4,TV,Electronics,499.99,1,499.99,12348,2023-05-03
4,5,Toothpaste,Beauty,2.99,4,11.96,12349,2023-05-03
1,2,Shampoo,Beauty,7.99,3,23.97,12346,2023-05-02
2,3,Laptop,Electronics,799.99,2,1599.98,12347,2023-05-02
0,1,Apple,Electronics,999.99,1,999.99,12345,2023-05-01

In [57]:
max_sales = sales.groupby("PurchaseDate",as_index=False)["Total"].sum()
max_sales

  PurchaseDate    Total
0   2023-05-01   999.99
1   2023-05-02  1623.95
2   2023-05-03   511.95
3   2023-05-04   399.98
4   2023-05-05   389.96
5   2023-05-06   499.99
6   2023-05-07    99.99

In [63]:
max_sales_day = max_sales[max_sales["Total"] == max_sales["Total"].max()]

In [65]:
max_sales_day

  PurchaseDate    Total
1   2023-05-02  1623.95

In [81]:
sales["CustomerID"].nunique()    ## kac farkli id var

10

In [87]:
sales.groupby("Category",as_index=False)["Total"].sum()

          Category    Total
0           Beauty    35.93
1      Electronics  3999.93
2          Fashion    99.99
3  Home Appliances   389.96

In [97]:
sales["Product"].nunique()

10

In [111]:
max_ID = sales.groupby("CustomerID",as_index=False)["Quantity"].max()
max_ID

   CustomerID  Quantity
0       12345         1
1       12346         3
2       12347         2
3       12348         1
4       12349         4
5       12350         2
6       12351         1
7       12352         3
8       12353         1
9       12354         1

In [123]:
max_ID[sales["Quantity"] == max_ID["Quantity"].max()]

   CustomerID  Quantity
4       12349         4